# Homebrew taps
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/livecheck"
brew "mas"


# Musikcube
tap "clangen/musikcube"
# Chunkwm / skhd
tap "koekeishiya/formulae"
tap "crisidev/homebrew-chunkwm"
# Neovim
tap "neovim/neovim"
# Go metalinter
tap "alecthomas/tap"


# Libraries
brew "libssh2"
brew "sdl2"
brew "sdl2_ttf"
brew "opencv"
brew "pybind11"
brew "ncurses"
brew "libarchive"
brew "libsodium"
brew "libusb"
brew "numpy"
brew "aubio"
brew "protobuf"
brew "portaudio"
brew "libplist"
brew "opencv@2"
brew "libyaml"

# Languages
brew "python"
brew "python@2"
brew "pypy3"
brew "gcc"
brew "go"
brew "haskell-stack"
brew "lua@5.1"
brew "nasm"
brew "nim"
brew "node"
brew "yarn"
brew "jq"
brew "jupyter"
brew "perl"
cask "java"
brew "mono"
brew "ruby"

# Language related
brew "cppcheck"
brew "clang-format"
brew "cmake"
brew "exercism"
brew "travis"
brew "swiftformat"
brew "ipython"
brew "gometalinter"
brew "ctags"

# Random display utlities
brew "asciinema"
brew "cmatrix"
brew "cowsay"
brew "fortune"
brew "neofetch"
brew "screenfetch"
brew "pipes-sh"

# Misc
# Replacement Utlities
brew "bat"
brew "exa"
brew "fzf"
brew "htop"
brew "icdiff"
brew "ripgrep"
# Utilities
brew "graphviz"
brew "brotli"
brew "aria2"
brew "jid"
brew "tldr"
brew "fasd"
brew "ffmpeg"
brew "ranger"
brew "socat"
brew "mitmproxy"
brew "netcat"
brew "nmap"
brew "pv"
brew "wget"
brew "telnet"
brew "smartmontools"
brew "findutils", args: ["with-default-names"]
brew "imagemagick"
brew "aspell"
brew "coreutils"
brew "wine"
brew "autoconf"
brew "automake"
brew "makedepend"
brew "just"

# Tools
brew "git"
brew "git-lfs"
brew "gawk"
brew "gnu-sed", args: ["with-default-names"]
brew "less"
brew "gdb"
brew "binutils"
brew "zsh"
brew "carthage"
brew "cocoapods"
cask "ngrok"
brew "dep"
brew "hugo"
brew "pipenv"

# Window Manager
brew "chunkwm", args: ["HEAD"], restart_service: true
brew "highlight"
brew "koekeishiya/formulae/skhd"

# Misc
brew "qemu"
brew "weechat", args: ["with-aspell", "with-lua", "with-perl", "with-python@2"]
brew "gettext"
brew "heroku"
brew "youtube-dl", args: ["HEAD"]
cask "qlcolorcode"
cask "qlstephen"
cask "google-cloud-sdk"
brew "ntfs-3g"


# Terminals
cask "hyper-canary"
cask "iterm2-nightly"
cask "alacritty"

# Editors
cask "sublime-text"
cask "visual-studio-code"
cask "intellij-idea"
brew "neovim"
brew "nano"
mas "Xcode", id: 497799835

# Applications
cask "discord-ptb"
cask "font-hack-nerd-font"
cask "leap-motion"
cask "osxfuse"
cask "spotify"
cask "vivaldi-snapshot"
cask "firefox-developer-edition"
cask "ti-connect-ce"
cask "appcleaner"
cask "alfred"
cask "calibre"
cask "sourcetree"
cask "imazing"
cask "discretescroll"
cask "mailspring"
cask "wireshark"
cask "loopback"

# MAS Applications
mas "1Password", id: 443987910
mas "Apple Configurator 2", id: 1037126344
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
